Revit 2027 API
ExporterIFC.GetFamilyName Method
 Gets the name of the element assigned to the current export state.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetFamilyName()
Public Function GetFamilyName As String
public:
String^ GetFamilyName()
member GetFamilyName : unit -> string
Return Value
String
 The family name.
Remarks
 The family name is prepared for use in IFC output during the call to PushExportState().
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace